"use client";

import { useState } from "react";

const faqData = [
    {
        categoryId: 1,
        question: "И-баримтын системд урамшуулал “урамшууллыг шилжүүлэхээр хүлээгдэж буй” төлөвтэй байна. Юу гэж ойлгох вэ?",
        answer:
            "Сангийн сайдын 2020 оны 1 дүгээр сарын 27-ны өдрийн 14 тоот тушаалаар батлагдсан “Нэмэгдсэн өртгийн албан татвар төлөгчийн худалдан авалтад төлсөн нэмэгдсэн өртгийн албан татварыг буцаан олгох журам”-ын 6.16.3. “урамшууллыг шилжүүлэхээр хүлээгдэж буй” баталгаажсан урамшууллын дүнг журмын дагуу шилжүүлэхээр Төрийн санд хүргүүлсэн;",
    },
    {
        categoryId: 1,
        question: "И-баримтын системд дансны мэдээллээ засварласан урамшуулал хэзээ орох вэ?",
        answer:
            "Сангийн сайдын 2020 оны 1 дүгээр сарын 27-ны өдрийн 14 тоот тушаалаар батлагдсан “Нэмэгдсэн өртгийн албан татвар төлөгчийн худалдан авалтад төлсөн нэмэгдсэн өртгийн албан татварыг буцаан олгох журам”-ын 6.16.1. “боловсруулагдаж буй” буцаан олгогдох албан татварын хэмжээ хянагдаж байна."
    },
    {
        categoryId: 1,
        question: "И-баримтын системд урамшуулал “боловсруулагдаж буй” төлөвтэй байна. Юу гэж ойлгох вэ?",
        answer:
            "Сангийн сайдын 2020 оны 1 дүгээр сарын 27-ны өдрийн 14 тоот тушаалаар батлагдсан “Нэмэгдсэн өртгийн албан татвар төлөгчийн худалдан авалтад төлсөн нэмэгдсэн өртгийн албан татварыг буцаан олгох журам”-ын 6.12. Татварын асуудал эрхэлсэн төрийн захиргааны байгууллага нь албан татвар төлөгчид мэдэгдэл хүргүүлснээс хойш 30 хоногийн дараа залруулгын гүйлгээний хүсэлтийг Төрийн санд хүргүүлнэ.",
    },
    {
        categoryId: 1,
        question: "И-баримтын системд урамшуулал “баталгаажсан” төлөвтэй байна. Юу гэж ойлгох вэ?",
        answer:
            "Сангийн сайдын 2020 оны 1 дүгээр сарын 27-ны өдрийн 14 тоот тушаалаар батлагдсан “Нэмэгдсэн өртгийн албан татвар төлөгчийн худалдан авалтад төлсөн нэмэгдсэн өртгийн албан татварыг буцаан олгох журам”-ын 6.16.2. “баталгаажсан” хянасан дүнг баталгаажуулсан;"
    },
    {
        categoryId: 2,
        question: "Орон сууцны хөнгөлөлт эдлэхэд ямар тайлан илгээх вэ?",
        answer:
            "Хувь хүний орлогын албан татварын тайланг /ТТ-06/ гаргана. Тайланг гарахдаа эхлээд нүүр тайлангаа хадгална. Дараа нь мэдээ хэсэгт орж бөглөнө. Тайлан гаргахаар бол энд дарна уу.",
    },
    {
        categoryId: 2,
        question: "Малчин хүн шинэ байр авсан бол хөнгөлөлт чөлөөлөлтөд хамрагдаж болох уу?",
        answer:
            "ХХОАТ-ын тухай хуулийн 24.4-д заасан хөнгөлөлтөд хамрагдах боломжтой. Албан татварын хөнгөлөлтийг ХХОАТ-ын тухай хуулийн 23.14-д Албан татварын хөнгөлөлтийг энэ хуульд заасан эцсийн хугацаанд тайлагнаж төлсөн албан татварын дүнгээс хэтрүүлэн эдлүүлэхгүй, 27.5. албан татварын хөнгөлөлт, чөлөөлөлтөд хамрагдах албан татвар төлөгч албан татварын тайлан гаргах үүрэгтэй бөгөөд уг тайлан нь түүнийг албан татварын хөнгөлөлт, чөлөөлөлтөд хамруулах үндсэн баримт болно гэж заасан.",
    },
    {
        categoryId: 2,
        question: "Орон сууц, сургалтын төлбөрийн хөнгөлөлт эдлэхэд заавал татвар төлсөн байх ёстой юу?",
        answer:
            "ХХОАТ-ын тухай хуулийн 23 дугаар зүйлийн 23.4.Монгол Улсын иргэн өөрийн албан татвар ногдсон орлого болон банк, санхүүгийн байгууллагаас авсан зээлийн хөрөнгөөр амьдран суух зориулалтаар зөвхөн хувьдаа, анх удаа орон сууцны барилга барьсан, эсхүл орон сууц худалдан авсан бол ийнхүү орон сууцны барилга барьсан, эсхүл орон сууц худалдан авахад зарцуулсан хөрөнгөтэй тэнцэх хэмжээний орлогод ногдох албан татварын хөнгөлөлтийг уг албан татвар төлөгчид эдлүүлэх бөгөөд энэ хөнгөлөлтийн хэмжээ 6 сая төгрөг хүртэл байна.Мөн хуулийн “23.14.Албан татварын хөнгөлөлтийг энэ хуульд заасан эцсийн хугацаанд тайлагнаж төлсөн албан татварын дүнгээс хэтрүүлэн эдлүүлэхгүй бөгөөд энэ хуулийн 23.1, 23.9-д зааснаас бусад албан татварын хөнгөлөлтийг 28 дугаар зүйлд заасны дагуу буцаан олгоно.” гэж заасан тул албан татвар төлөөгүй, тайлагнасан ногдлыг бүрэн төлөөгүй бол хөнгөлөлтөд хамрагдахгүй. Иймд тайлагнасан татварыг бүрэн төлсөн тохиолдолд тухайн дүнгээс хэтрүүлэхгүй хөнгөлөлт эдэлнэ. Хуулийн заалтыг энд дарж харна уу.",
    },
    {
        categoryId: 2,
        question: "Хөрөнгийн үнэлгээний тайлан гэж юу вэ?",
        answer:
            "ХХОАТ-ын тухай хуулийн 23 дугаар зүйлийн 23.4.Монгол Улсын иргэн өөрийн албан татвар ногдсон орлого болон банк, санхүүгийн байгууллагаас авсан зээлийн хөрөнгөөр амьдран суух зориулалтаар зөвхөн хувьдаа, анх удаа орон сууцны барилга барьсан, эсхүл орон сууц худалдан авсан бол ийнхүү орон сууцны барилга барьсан, эсхүл орон сууц худалдан авахад зарцуулсан хөрөнгөтэй тэнцэх хэмжээний орлогод ногдох албан татварын хөнгөлөлтийг уг албан татвар төлөгчид эдлүүлэх бөгөөд энэ хөнгөлөлтийн хэмжээ 6 сая төгрөг хүртэл байна гэж заасан. Иймд хувьдаа орон сууц барьсан бол материал худалдан авсан төлбөрийн баримт, эсхүл хөрөнгийн үнэлгээний эрх бүхий байгууллагаар хийлгэсэн үнэлгээний тайланг хэлнэ. Хуулийн заалтыг харахаар бол энд дарна уу.",
    },

    {
        categoryId: 2,
        question: "2018 онд байрны гэрчилгээ гараад хөнгөлөлт эдлээгүй 2021 онд эдлэж болох уу?",
        points: [
            "“Хувь хүний орлогыг албан татвараас чөлөөлөх, албан татварын хөнгөлөлт эдлүүлэх журам”-ын 1.3-д Албан татварын хөнгөлөлт, чөлөөлөлтийг эдлүүлэхдээ Татварын ерөнхий хуулийн 15 дугаар зүйлд заасан хугацааг баримтлана гэж заасан. ТЕХ-д заасан татварын хөөн хэлэлцэх хугацаанд хамаарч байгаа бол хөнгөлөлтөд хамрагдах боломжтой.",
            "Мөн ХХОАТ-ын тухай хуулийн 23.4-д зөвхөн амьдран суух зориулалтаар анх удаа худалдан авсан орон сууц, орон сууцны барилга барьсан гэж заасан байгааг анхаарах зүйтэй. Мөн хуулийн дагуу 2020-01-01 ээс өмнөх худалдан авсан бол татварын чөлөөлөлтөд хамрагдах бөгөөд чөлөөлөлтийн хэмжээ 30 хүртлэх сая төгрөгийн орлогод хамаарна.",
        ],
    },
    {
        categoryId: 3,
        question: "ҮШ-ийн тайлан",
        answer: "Монгол Улсад бүртгэлтэй хоёр харилцан хамааралтай этгээдийн нэг нь үнэ шилжилтийн тохируулгаар татварын суурийг өсгөсөн бол нөгөө этгээд энэ тохируулгад үндэслэн татварын суурийг бууруулах үнэ шилжилтийн тохируулгыг хийхгүй. Учир нь ТЕХ-ийн 37 дугаар зүйлийн 37.1, 37.2, Сангийн сайдын 2019 оны 308 дугаар тушаалаар батлагдсан “Үнэ шилжилтийн тохируулга хийх хамгийн тохиромжтой аргыг сонгох, хэрэглэх журам”-ын 2.2-т заасны дагуу татварын суурийг бууруулах аливаа тохируулгыг хийхгүй байх зохицуулалттай. Харин мөн хуулийн 31 дүгээр зүйлийн 31.1-д заасан тайлан засварлах эрхийн хүрээнд дараагийн тайлант жилд багтаан холбогдох засварыг хийж болох бөгөөд, 31.2-т заасны дагуу тайлангийн ногдолыг бууруулах бол нотлох анхан шатны болон холбогдох бичиг баримтыг засварлан тайлангийн хамт ирүүлнэ."
    },
    {
        categoryId: 3,
        question: "Машины татвараа хэрхэн төлөх вэ?",
        answer: "Та и-баримтын аппликейшн, smartcar.mn, itax.mta.mn, etax.mta.mn мөн интернэт банкныхаа төлөлт хэсэг рүү ороод татвар төлөх цэсээ сонгоод хөрөнгийн дугаар дээрээ автомашины улсын дугаарыг бичээд төлж болно"
    },
    {
        categoryId: 3,
        question: "Үл хөдлөх хөрөнгийн татвараа хэрхэн төлөх вэ?",
        answer:
            "Та и-баримтын аппликейшн, болон интернэт банкныхаа төлөлт хэсэг рүү ороод татвар төлөх цэсээ сонгоод нэхэмжлэлийн дугаараа бичээд төлж болно",
    },
    {
        categoryId: 3,
        question: "Үл хөдлөх хөрөнгө борлуулсан татвараа яаж төлөх вэ?",
        answer:
            "Та itax.mta.mn хаягаар орж төлбөрийн даалгавар үүсгээд интернэт банкныхаа төлөлт хэсэг рүү ороод татвар төлөх цэсээ сонгоод төлбөрийн даалгаврын дугаараа бичээд төлнө. Аль эсвэл ойрцоох банкинд төлбөрийн даалгаврын дугаарын дагуу төлж болно. Төлбөрийн даалгавар үүсгэх бол энд  дарна уу.",
    },
    {
        categoryId: 3,
        question: "Газрын төлбөрөө яаж төлөх вэ?",
        answer:
            "Та и-баримтын аппликейшн, эсвэл интернэт банкныхаа төлөлт хэсэг рүү ороод татвар төлөх цэсээ сонгоод нэхэмжлэлийн дугаараа бичээд төлнө. Мөн өөрт ойрхон банкны салбар дээр очоод нэхэмжлэлийн дугаарын дагуу төлбөрөө төлж болно",
    },
    {
        categoryId: 4,
        question: "Цалин хөдөлмөрийн хөлс",
        answer: "Хувь хүний орлогын албан татварын тухай хуулийн 7 дугаар зүйлийн 7.1.Албан татвар төлөгчийн цалин, хөдөлмөрийн хөлс, шагнал, урамшуулал болон тэдгээртэй адилтгах хөдөлмөр эрхлэлтийн орлогод дараах орлогыг хамруулна:"

        ,
        points: ['7.1.1.ажил олгогчтой байгуулсан хөдөлмөрийн гэрээнд заасны дагуу авч байгаа үндсэн цалин, нэмэгдэл хөлс, нэмэгдэл, шагнал, урамшуулал, амралтын олговор, тэтгэвэр, тэтгэмж, тэдгээртэй адилтгах бусад орлого;',
            '7.1.2.ажил олгогчоос ажилтан, түүний гэр бүлийн гишүүнд олгосон тэтгэмж болон түүнтэй адилтгах орлого;',
            '7.1.3.ажил олгогчоос ажилтан, түүний гэр бүлийн гишүүнд өгсөн бэлэг;',
            '7.1.4.төлөөлөн удирдах зөвлөл, хяналтын зөвлөл, орон тооны бус зөвлөл болон бусад зөвлөл, хороо, ажлын хэсгийн гишүүний цалин хөлс, шагнал, урамшуулал, тэдгээртэй адилтгах орлого;',
            '7.1.5.гадаад, дотоодын аж ахуйн нэгж, байгууллага, иргэн болон бусад этгээдээс өгсөн бүх төрлийн шагнал, урамшуулал, тэдгээртэй адилтгах орлого;',
            '7.1.6.үндсэн ажлын газраас бусад хуулийн этгээд болон хувь хүнтэй байгуулсан гэрээний үндсэн дээр ажил, үүрэг гүйцэтгэж авсан хөдөлмөрийн хөлс, шагнал, нэмэгдэл, тэтгэмж, тэдгээртэй адилтгах бусад орлого;',
            '7.1.7.хоол, унааны мөнгө.',
            'Хуулийн заалтыг энд дарж харна уу',
        ]
    },
    {
        categoryId: 4,
        question: "Үйл ажиллагааны орлого",
        answer: "Хувь хүний орлогын албан татварын тухай хуулийн 8 дугаар зүйлийн"

        ,
        points: ['7.1.1.ажил олгогчтой байгуулсан хөдөлмөрийн гэрээнд заасны дагуу авч байгаа үндсэн цалин, нэмэгдэл хөлс, нэмэгдэл, шагнал, урамшуулал, амралтын олговор, тэтгэвэр, тэтгэмж, тэдгээртэй адилтгах бусад орлого;',
            '8.1.Үйл ажиллагааны орлогод хуулийн этгээд байгуулахгүйгээр үйл ажиллагаа явуулж олсон дараах орлогыг хамруулна:',
            '  8.1.2.хувиараа бүтээгдэхүүн үйлдвэрлэх, борлуулах, ажил гүйцэтгэх, үйлчилгээ үзүүлэх, зуучлалын үйл ажиллагаа эрхэлж олсон орлого;',
            '        8.1.3.шинжлэх ухаан, утга зохиол, урлагийн бүтээл туурвих, шинэ бүтээл, бүтээгдэхүүний болон ашигтай загвар зохион бүтээх, спортын тэмцээн, урлагийн тоглолт зохион байгуулах, тэдгээрт оролцох замаар олсон орлого, тэдгээртэй адилтгах бусад орлого;',
            '           8.1.4.эрхэлж байгаа үйл ажиллагаатай холбоотойгоор үнэ төлбөргүй бусдаас авсан бараа, ажил, үйлчилгээ.',
            '8.2.Тогтмол бус үйл ажиллагаа эрхэлж олсон орлогыг үйл ажиллагааны орлогод хамруулна.',
            'Хуулын заалтыг  энд дарж харна уу',
        ]
    },
    {
        categoryId: 4,
        question: "Хөрөнгийн орлого",
        answer: "Хувь хүний орлогын албан татварын тухай хуулийн 9 дүгээр зүйлийн"

        ,
        points: ['9.1.Хөрөнгийн орлогод дараах орлогыг хамруулна:',
            '  9.1.1.хөрөнгө ашиглуулсан болон түрээслүүлсний орлого;',
            '  9.1.2.эрхийн шимтгэлийн орлого;',
            '9.1.3.ногдол ашгийн орлого;',
            '9.1.4.хүүгийн орлого.',
            '9.2.Эрхийн шимтгэлийн орлогод Аж ахуйн нэгжийн орлогын албан татварын тухай хуулийн 9.2-т заасныг хамааруулна.',
            '9.3.Ногдол ашгийн орлогод Аж ахуйн нэгжийн орлогын албан татварын тухай хуулийн 9.3-т заасныг хамааруулна.',
            '9.4.Хүүгийн орлогод Аж ахуйн нэгжийн орлогын албан татварын тухай хуулийн 9.4-т заасныг хамааруулна.',
        ]
    },
    {
        categoryId: 4,
        question: "Хөрөнгө борлуулсан шилжүүлсний орлого",
        answer: "Хувь хүний орлогын албан татварын тухай хуулийн 10 дугаар зүйлийн"

        ,
        points: ['9.1.Хөрөнгийн орлогод дараах орлогыг хамруулна:',
            '10.1.Хөрөнгө борлуулсан, шилжүүлсний орлогод дараах орлогыг хамруулна:',
            '10.1.1.үл хөдлөх эд хөрөнгө борлуулсны орлого;',
            '  10.1.2.газар эзэмших, ашиглах эрх болон бусад биет бус хөрөнгө борлуулсан, шилжүүлсний орлого;',
            '10.1.3.хөдлөх эд хөрөнгө борлуулсны орлого;',
            '10.1.4.хувьцаа, үнэт цаас болон санхүүгийн бусад хэрэгсэл борлуулсны орлого.',
            '10.2.Биет бус хөрөнгө борлуулсан, шилжүүлсний орлогод албан татвар төлөгч өөрийн эдийн бус хөрөнгө өмчлөх эрхийг хуульд заасны дагуу бусдад шилжүүлснээс олсон орлогыг хамааруулна.',
        ]
    },
    {
        categoryId: 4,
        question: "Шууд бус орлого",
        answer: "Хувь хүний орлогын албан татварын тухай хуулийн 11 дүгээр зүйлийн",
        points: ['9.1.Хөрөнгийн орлогод дараах орлогыг хамруулна:',
            '11.1.Цалин, хөдөлмөрийн хөлс, шагнал, урамшуулал дээр ажил олгогчоос нэмж олгож байгаа тухайн ажилтны албан үүргээ гүйцэтгэхэд шууд холбогдолгүй дараах бараа, ажил, үйлчилгээний орлогыг шууд бус орлогод хамруулна:',
            '11.1.1.үнэ төлбөргүй, эсхүл хөнгөлөлттэй үнээр тээврийн хэрэгслээр үйлчилсэн;',
            '11.1.2.орон сууцны ашиглалтын болон түрээсийн зардлын төлбөр, байрын хөлс, түлшний зардлын төлбөр;',
            ' 11.1.3.үзвэр үйлчилгээний олговор;',
            ' 11.1.4.ахуйн үйлчлэгч, жолооч, цэцэрлэгч болон бусад үйлчилгээ үзүүлсний зардлын төлбөр;',
            '11.1.5.ажил олгогч, эсхүл бусад этгээдэд төлөх өр барагдуулсны төлбөр;',
            '11.1.6.арилжааны зээлийн хүүгээс доогуур хүүтэй олгосон зээлийн хүүгийн зөрүү;',
            '   11.1.7.ажил олгогчийн төлсөн энэ хуулийн 11.2.7-д зааснаас бусад сайн дурын даатгалын хураамж;',
            ' 11.1.8.гэр бүлийн гишүүний сургалтын төлбөр;',
            '11.1.9.Монгол Улсад нүүж ирэх болон буцахтай холбогдон гарах зардлын төлбөр;',
            '11.1.10.эрс тэс уур амьсгалд ажиллаж амьдарсны нэмэгдэл;',
            ' 11.1.11.энэ хуулийн 11.1.1, 11.1.2, 11.1.3, 11.1.4, 11.1.5, 11.1.6, 11.1.7, 11.1.8, 11.1.9, 11.1.10-т заасантай адилтгах бусад орлого.',

        ]
    },
];

const categoryList = [
    { id: 1, name: "E-Баримт" },
    { id: 2, name: "Хөнгөлөлт чөлөөлөлт" },
    { id: 3, name: "Миний төлдөг татварууд" },
    { id: 4, name: "Та ямар орлоготой вэ" },
];

const FaqAccordion = ({
    data,
    categories,
    groupId,
}: {
    data: typeof faqData;
    categories: typeof categoryList;
    groupId: string;
}) => {
    const [openQuestion, setOpenQuestion] = useState<string | null>(null);

    const toggleQuestion = (questionKey: string) => {
        setOpenQuestion((prev) => (prev === questionKey ? null : questionKey));
    };

    return (
        <div className="accordion" id={`faqAccordion-${groupId}`} >
            {categories.map((category) => {
                const filteredFaqs = data.filter((faq) => faq.categoryId === category.id);
                const isAnyQuestionOpen = filteredFaqs.some((_, i) => openQuestion === `${category.id}-${i}`);

                return (
                    <div key={category.id} className="accordion-item accordion-style-one mb-4" style={{ height: isAnyQuestionOpen ? "100%" : 500 }}>
                        <h2 className="accordion-header">
                            <div className="accordion-button ">{category.name}</div>
                        </h2>
                        <div className="accordion-body" style={{ flexGrow: 1 }}>
                            {filteredFaqs.length > 0 ? (
                                filteredFaqs.map((faq, i) => {
                                    const questionKey = `${category.id}-${i}`;
                                    const isOpen = openQuestion === questionKey;
                                    return (
                                        <ul key={questionKey} className="mb-3 list-style-two" >
                                            <li

                                                onClick={() => toggleQuestion(questionKey)}
                                                style={{ cursor: "pointer", fontSize: 14, fontWeight: 500 }}
                                            >
                                                {faq.question}
                                            </li>

                                            {isOpen && (
                                                <div>
                                                    <p style={{ marginLeft: 25, fontSize: 12, marginBottom: 0 }}>{faq.answer}</p>
                                                    <div>
                                                        {faq.points && faq.points.map((point, idx) => (
                                                            <p key={idx}
                                                                style={{ cursor: "pointer", fontSize: 12, fontWeight: 300, marginLeft: 30, marginBottom: 0 }}>{point}</p>
                                                        ))}
                                                    </div>
                                                </div>
                                            )}

                                            {i !== filteredFaqs.length - 1 && <hr />}
                                        </ul>
                                    );
                                })
                            ) : (
                                <p>Асуулт байхгүй байна.</p>
                            )}
                        </div>
                    </div>
                );
            })}
        </div>
    );
};

const FaqV1 = () => {
    const leftCategories = categoryList.filter((c) => [1, 2].includes(c.id));
    const rightCategories = categoryList.filter((c) => [3, 4].includes(c.id));

    const leftFaqData = faqData.filter((faq) => [1, 2].includes(faq.categoryId));
    const rightFaqData = faqData.filter((faq) => [3, 4].includes(faq.categoryId));

    return (
        <div className="faq-style-one-area chooseus-style-two-area default-padding">
            <div className="container">
                <div
                    className="faq-style-two-items chooseus-style-two-items bg-cover"
                    style={{ backgroundImage: "url(/assets/img/shape/2.jpg)" }}
                >
                    <div className="row">
                        <div className="col-xl-6">
                            <div className="choose-us-style-two">
                                <FaqAccordion
                                    data={leftFaqData}
                                    categories={leftCategories}
                                    groupId="left"
                                />
                            </div>
                        </div>
                        <div className="col-xl-6">
                            <div className="choose-us-style-two">
                                <FaqAccordion
                                    data={rightFaqData}
                                    categories={rightCategories}
                                    groupId="right"
                                />
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
};



export default FaqV1;
