import Animate from "../animation/Animate";

interface DataType {
  id: number;
  date?: string;
  dateIcon?: string;
  thumbFull?: string;
}

interface BlogSingleProps {
  blogInfo?: DataType;
  totalBlogs?: number;
}

const BlogSingleContent = ({}: BlogSingleProps) => {
  // Blogs Navigation
  return (
    <>
      <div className="blog-area single full-blog full-blog ">
        <div className="container">
          <h1 className="text-center">
            {" "}
            &#39;Татварын хөгжил дэвшил холбоо&#39; ТББ-ын Үйл ажиллагааны
            Танилцуулга
          </h1>
          <Animate className="animate__animated animate__fadeInUp">
            <div className="blog-content">
              <div className="blog-style-two item">
                <div className="blog-item-box">
                  <div className="info">
                    <p>
                      2022 оны 6 сард үүсгэн байгуулагдсан &#39;Татварын хөгжил
                      дэвшил холбоо&#39; ТББ нь санхүү, татварын салбарын өндөр
                      туршлагатай, мэргэшсэн мэргэжилтнүүдийн санаачилгаар
                      байгуулагдсан. Тус байгууллага нь татварын албанд 20 ба
                      түүнээс дээш жил ажилласан татварын итгэмжит зөвлөхүүд,
                      МНБ, ТМЗ зэрэг мэргэжилтнүүдээс бүрддэг.{" "}
                    </p>
                    <h3>Үндсэн Үнэт зүйлс ба Эрхэм зорилго</h3>
                    <ul>
                      <li>
                        Татварын хуулийг хэрэгжүүлэхэд татвар төлөгчдөд
                        мэргэжлийн түвшний зөвлөгөө, үйлчилгээ үзүүлэх
                      </li>
                      <li>
                        Татвар төлөгч бүрийн эрх ашгийг хамгаалсан шударга
                        орчныг бүрдүүлэх.
                      </li>
                      <li>Улс орны эдийн засгийн хөгжилд хувь нэмэр оруулах</li>
                    </ul>
                    <h3>Гол Зорилтууд</h3>
                    <ul>
                      <li>
                        Татварын талаар судалгаа хийх, татвар төлөгчдийн эрх
                        ашгийг хамгаалах
                      </li>
                      <li>
                        Ижил зорилготой төрийн болон төрийн бус байгууллагуудтай
                        хамтран ажиллах
                      </li>
                      <li>
                        Сургалт, төслүүд хэрэгжүүлэх, бизнес эрхлэгчдэд татварын
                        боловсрол олгох
                      </li>
                    </ul>
                    <h3>Гишүүнчлэл</h3>
                    <h5>
                      {" "}
                      &#39;Татварын хөгжил дэвшил холбоо&#39; ТББ нь өнөөдрийн
                      байдлаар 220 гишүүнтэй бөгөөд:
                    </h5>
                    <ul>
                      <li>
                        55 жинхэнэ гишүүн (МНБ болон ТМЗ зэрэг мэргэжилтнүүд)
                      </li>
                      <li>165 дэмжигч гишүүн бүртгэгдээд байна.</li>
                    </ul>
                    <h3>Хийсэн Ажлууд</h3>
                    <ul>
                      <li>
                        УИХ-ын төсвийн байнгын хорооны дэд ажлын хэсэгт орж
                        ажилласан
                      </li>
                      <li>
                        ТМЗ-ын тухай хуулийн нэмэлт өөрчлөлтөд санал боловсруулж
                        оролцсон
                      </li>
                      <li>
                        500 гаруй бизнес эрхлэгчдэд татварын сургалт, мэргэжлийн
                        зөвлөгөө өгсөн
                      </li>
                      <li>
                        Нийслэл болон дүүргийн татварын албадын дарга нартай
                        уулзалт, танилцуулга зохион байгуулсан
                      </li>
                    </ul>
                    <h3>Ирээдүйн Төлөвлөгөө</h3>
                    <ul>
                      <li>Татварын хуулийн шинэчлэлд идэвхтэй оролцох</li>
                      <li>ТМЗ-ын тухай хуулийг шинэчлэн боловсруулах</li>
                      <li>
                        Жижиг, бичил бизнес эрхлэгчдэд чиглэсэн татварын
                        боловсрол олгох
                      </li>
                      <li>Татварын албатай илүү үр дүнтэй хамтран ажиллах</li>
                      <li>
                        Санхүү, татварын тайлангийн зөрүүг зохицуулах сургалт,
                        хөтөлбөр хэрэгжүүлэх
                      </li>
                      <li>
                        Татвар төлөгчдийн эрх ашгийг хамгаалах мэргэжлийн
                        зөвлөгөө, үйлчилгээг өргөжүүлэх
                      </li>
                    </ul>
                  </div>
                </div>
              </div>
            </div>
          </Animate>
        </div>
      </div>
    </>
  );
};

export default BlogSingleContent;
